Revit 2027 API
PipeSettings.GetFlowConvertionServerInfo Method
 Get the MEPServerInfo of the current plumbing flow convertion server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPCalculationServerInfo GetFlowConvertionServerInfo()
Public Function GetFlowConvertionServerInfo As MEPCalculationServerInfo
public:
MEPCalculationServerInfo^ GetFlowConvertionServerInfo()
member GetFlowConvertionServerInfo : unit -> MEPCalculationServerInfo
Return Value
MEPCalculationServerInfo
 The MEPServerInfo of the current plumbing flow convertion server.
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace